resources/wsman/failed.xml

<s:Envelope
    xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd"
    xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd">
    <s:Header>
        <a:To>
            http://10.10.0.3:5985/wsman?PSVersion=7.4.10
            </a:To>
        <a:Action
            s:mustUnderstand="true">
            http://schemas.xmlsoap.org/ws/2004/09/transfer/Create
            </a:Action>
        <a:ReplyTo
            s:mustUnderstand="true">
            <a:Address>
                http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous
                </a:Address>
            </a:ReplyTo>
        <a:MessageID>
            uuid:622d032a-f9b3-498d-b447-1359c3bb14f3
            </a:MessageID>
        <w:ResourceURI
            s:mustUnderstand="true">
            http://schemas.microsoft.com/powershell/Microsoft.PowerShell
            </w:ResourceURI>
        <w:MaxEnvelopeSize
            s:mustUnderstand="true">
            512000
            </w:MaxEnvelopeSize>
        <w:Locale
            xml:lang="en-US"
            s:mustUnderstand="false"/>
        <p:DataLocale
            s:mustUnderstand="false"
            xml:lang="en-CA"/>
        <p:SessionId
            s:mustUnderstand="false">
            uuid:ac93b121-bf5e-4486-9e8e-cc336a77efe2
            </p:SessionId>
        <p:OperationID
            s:mustUnderstand="false">
            uuid:9178a378-f1b0-4ede-9ee2-52e43056aa28
            </p:OperationID>
        <p:SequenceId
            s:mustUnderstand="false">
            1
            </p:SequenceId>
        <w:OptionSet
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            s:mustUnderstand="true">
            <w:Option
                Name="protocolversion"
                MustComply="true">
                2.3
                </w:Option>
            </w:OptionSet>
        <w:OperationTimeout>
            PT180.000S
            </w:OperationTimeout>
        <rsp:CompressionType
            xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"
            s:mustUnderstand="true">
            xpress
            </rsp:CompressionType>
        </s:Header>
    <s:Body>
        <rsp:Shell
            xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell"
            ShellId="07936b27-7752-4325-8b0d-e7a1e9448320"
            Name="Runspace1">
            <rsp:InputStreams>
                stdin pr
                </rsp:InputStreams>
            <rsp:OutputStreams>
                stdout
                </rsp:OutputStreams>
            <creationXml
                xmlns="http://schemas.microsoft.com/powershell">
                 […]AAAAAAAAAAEAAAAAAAAAAAMAAADHAgAAAAIAAQAHk2snd1JDJYsN56HpRIMgAAAAAAAAAAAAAAAAAAAAADxPYmogUmVmSWQ9IjAiPjxNUz48VmVyc2lvbiBOPSJQU1ZlcnNpb24iPjIuMDwvVmVyc2lvbj48VmVyc2lvbiBOPSJTZXJpYWxpemF0aW9uVmVyc2lvbiI+MS4xLjAuMTwvVmVyc2lvbj48VmVyc2lvb
                </creationXml>
            </rsp:Shell>
        </s:Body>
    </s:Envelope>
